// Найти сумму чисел одномерного массива, стоящих на нечётной позиции.

Console.WriteLine("Hello, World!");
