// Написать программу вычисления значения функции y = f(a)
// Пример y = a ^ 2 + 33

Console.WriteLine("Введите число a: ");
int a = int.Parse(Console.ReadLine());

int y = a * a + 33;
Console.WriteLine("y = a ^ 2 + 33 = " + y);
