// Найти сумму чисел от 1 до А

Console.WriteLine("Введите число A: ");
int A = int.Parse(Console.ReadLine());

int sum = 0;
int index = 0;

Console.WriteLine("Введите целое число больше 1");

// if (A >= 1)
// {
//     while (index <= A)
//     {
//         int sum = index + A;
//         Console.WriteLine(sum);
//         int index = index + 1;
//     }
// }
// else
// {
//     Console.WriteLine("Введите целое число больше 1");
// }

