// Вывести квадрат числа

Console.Write("Введите число")






//Console.WriteLine("Введите число N");

//if ( m == n*n )
//{
   // Console.WriteLine(n);
//}
//else 
//{
//    Console.WriteLine(m);
//}



//Console.Write("Введите ваше имя ");
//string username = Console.ReadLine();
//Console.Write("Привет, ");
//Console.Write(username);